Revit 2027 API
SolidGlass.SolidglassGlossiness Property
 The property labeled "Roughness" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SolidglassGlossiness { get; }
Public Shared ReadOnly Property SolidglassGlossiness As String
	Get
public:
static property String^ SolidglassGlossiness {
	String^ get ();
}
static member SolidglassGlossiness : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Reference
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace